dict={"파렴치한":"뻔뻔스러워 사람의 도리를 지킬줄 모르다는 뜻 (破廉恥漢)",
"파벽음롱":"정신이나 신체에 심각한 장애가 있는 사람을 말한다.(跛躄喑聾)",

"파안대소":
"얼굴빛을 부드럽게 하여 웃음 (破顔大笑)",

"평지풍파":
"평온한 자리에서 뜻밖의 분쟁이 일어남을 이르는 말. (平地風波)",

"패도정치":
"무력(武力)에 의한 정치방식 (覇道政治)",

"폐포파립":
"해진 옷과 부서진 갓이라는 뜻으로, 너절하고 구차한 차림새를 비유적으로 이르는 말 (敝袍破笠)",

"포전인옥":
"벽돌을 던져서 옥구슬을 얻다. 비슷해 보이지만 값싼 미끼를 던져서 적을 낚아 적을 속여서 유인한다. (抛磚引玉)",

"포한종천":
"원한을 품어 죽어도 풀길이 없음(抱恨終天)",

"풍비박산":
"하나도 온전치 못하고 모든 게 사방으로 날아 흩어짐 (風飛雹散)",

"풍우장중":
"몹시 바쁜 판 또는 비바람 속에서 치르는 과거의 장중(場中)을 말한다. (風雨場中)",

"풍찬노숙":
"객지에서 겪는 많은 고생 (風餐露宿)",

"필부필부":
"평범한 남녀을 말한다. (匹夫匹婦)",

"필유곡절":
"반드시 무슨 까닭이 있음. (必有曲折)"}

user_input = input("검색할 고사성어를 입력하세요 >>>")
print(f"{user_input}: {dict[user_input]}")